CSI API ETABS v1
cPropArea.SetDeckFilled Method
 Initializes a filled deck property
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int SetDeckFilled(
	string Name,
	double SlabDepth,
	double RibDepth,
	double RibWidthTop,
	double RibWidthBot,
	double RibSpacing,
	double ShearThickness,
	double UnitWeight,
	double ShearStudDia,
	double ShearStudHt,
	double ShearStudFu
)
Function SetDeckFilled (
	Name As String,
	SlabDepth As Double,
	RibDepth As Double,
	RibWidthTop As Double,
	RibWidthBot As Double,
	RibSpacing As Double,
	ShearThickness As Double,
	UnitWeight As Double,
	ShearStudDia As Double,
	ShearStudHt As Double,
	ShearStudFu As Double
) As Integer
Dim instance As cPropArea
Dim Name As String
Dim SlabDepth As Double
Dim RibDepth As Double
Dim RibWidthTop As Double
Dim RibWidthBot As Double
Dim RibSpacing As Double
Dim ShearThickness As Double
Dim UnitWeight As Double
Dim ShearStudDia As Double
Dim ShearStudHt As Double
Dim ShearStudFu As Double
Dim returnValue As Integer
returnValue = instance.SetDeckFilled(Name,
	SlabDepth, RibDepth, RibWidthTop,
	RibWidthBot, RibSpacing, ShearThickness,
	UnitWeight, ShearStudDia, ShearStudHt,
	ShearStudFu)
int SetDeckFilled(
	String^ Name,
	double SlabDepth,
	double RibDepth,
	double RibWidthTop,
	double RibWidthBot,
	double RibSpacing,
	double ShearThickness,
	double UnitWeight,
	double ShearStudDia,
	double ShearStudHt,
	double ShearStudFu
)
abstract SetDeckFilled :
        Name : string *
        SlabDepth : float *
        RibDepth : float *
        RibWidthTop : float *
        RibWidthBot : float *
        RibSpacing : float *
        ShearThickness : float *
        UnitWeight : float *
        ShearStudDia : float *
        ShearStudHt : float *
        ShearStudFu : float -> int
Parameters
Name
Type: System.String
 The name of an existing deck property created with the SetDeck(String, eDeckType, eShellType, String, Double, Int32, String, String) function.
SlabDepth
Type: System.Double
 Slab Depth, tc
RibDepth
Type: System.Double
 Rib Depth, hr
RibWidthTop
Type: System.Double
 Rib Width Top, wrt
RibWidthBot
Type: System.Double
 Rib Width Bottom, wrb
RibSpacing
Type: System.Double
 Rib Spacing, sr
ShearThickness
Type: System.Double
 Deck Shear Thickness
UnitWeight
Type: System.Double
 Deck Unit Weight
ShearStudDia
Type: System.Double
 Shear Stud Diameter
ShearStudHt
Type: System.Double
 Shear Stud Height, hs
ShearStudFu
Type: System.Double
 Shear Stud Tensile Strength, Fu
Return Value
Type: Int32
 Returns zero if the property is successfully initialized; otherwise it returns a nonzero value.
Remarks
Examples
Public Sub Example()
       Dim SapModel As cSapModel
       Dim EtabsObject As cOAPI
       Dim ret As Integer = -1
       Dim DeckType As eDeckType
       Dim ShellType As eShellType
       Dim MatProp As String
       Dim Thickness As Double
       Dim Color As Integer
       Dim Notes As String
       Dim GUID As String
       Dim SlabDepth As Double
       Dim RibDepth As Double
       Dim RibWidthTop As Double
       Dim RibWidthBot As Double
       Dim RibSpacing As Double
       Dim DeckShearThickness As Double
       Dim DeckUnitWeight As Double
       Dim ShearStudDia As Double
       Dim ShearStudHt As Double
       Dim ShearStudFu As Double
   'create ETABS object
       Dim myHelper as cHelper = New Helper
       EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")
   'start ETABS application
       ret = EtabsObject.ApplicationStart()
   'create SapModel object
       SapModel = EtabsObject.SapModel
   'initialize model
       ret = SapModel.InitializeNewModel()
   'create steel deck template model
       ret = SapModel.File.NewSteelDeck(4,12,12,4,4,24,24)
   'set new area property
       ret = SapModel.PropArea.SetDeck("MyShellProp1A", eDeckType.Filled, eShellType.ShellThin, "4000Psi", 14)
   'set new area property
       ret = SapModel.PropArea.SetDeckFilled(Name:="MyShellProp1A", SlabDepth:=15.6, RibDepth:=1.1, RibWidthTop:=2.3, RibWidthBot:=2.4, _
                                             RibSpacing:=7, ShearThickness:=5, UnitWeight:=3.1, ShearStudDia:=1.02, ShearStudHt:=4.4, ShearStudFu:=2.01)
   'get area property data
       ret = SapModel.PropArea.GetDeck("MyShellProp1A", DeckType, ShellType, MatProp, Thickness, Color, Notes, GUID)
   'get area property data
       ret = SapModel.PropArea.GetDeckFilled("MyShellProp1A", SlabDepth, RibDepth, RibWidthTop, RibWidthBot, _
                                             RibSpacing, DeckShearThickness, DeckUnitWeight, ShearStudDia, ShearStudHt, ShearStudFu)
   'close ETABS
       EtabsObject.ApplicationExit(False)
   'clean up variables
       SapModel = Nothing
       EtabsObject = Nothing
   End Sub
See Also
Reference
cPropArea Interface
ETABSv1 Namespace